read_verilog sources/*.v
blackbox \74*                           # stop existing 74-series ICs from being synthesized into gates
synth -top test2                        # synthesize the design
flatten                                 # flatten the heirarchy so all gates and manually created 74-series ICs are at the top level
dfflibmap -liberty liberty/less.lib
abc -liberty liberty/less.lib
write_verilog out.sv
write_json out.json
dump -o out.net
stat -liberty liberty/less.lib