read_verilog sources/test2.v
blackbox \74*
synth -top test2
flatten
dfflibmap -liberty liberty/less.lib
abc -liberty liberty/less.lib
write_verilog out.sv
write_json out.json
dump -o out.net
stat -liberty liberty/less.lib