read_verilog sources/test2.v
blackbox \74*                           # stop existing 74-series ICs from being synthesized into gates
synth -flatten -top test2               # synthesize the design
dfflibmap -liberty liberty/less.lib
abc -liberty liberty/less.lib
write_verilog out.sv
write_json out.json
dump -o out.net
stat -liberty liberty/less.lib