read_verilog *.v
synth -top test2
dfflibmap -liberty liberty/74ac.lib
abc -liberty liberty/basic.lib
write_verilog out.sv
dump -o out.net
stat -liberty liberty/74ac.lib