read_verilog sources/*.v
synth -top test
dfflibmap -liberty liberty/74ac.lib
abc -liberty liberty/7400.lib
write_verilog out.sv
write_json out.json
dump -o out.net
stat -liberty liberty/74ac.lib